In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [51]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
s.size

6

In [5]:
len(s)

6

In [6]:
s.dtypes

dtype('float64')

In [7]:
dates = pd.date_range('2017-1-2',periods = 6)
#dates1 = pd.date_range(start = '2014-1-1 ',end = '2014-1-5',periods = 2,name = 'time_data')

In [8]:
dates

DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04', '2017-01-05',
               '2017-01-06', '2017-01-07'],
              dtype='datetime64[ns]', freq='D')

In [9]:
pd.date_range?

In [10]:
data = np.random.randint(6,36,(6,6))

In [11]:
data

array([[ 6, 10, 13, 22, 20, 26],
       [33, 35, 23, 18, 14, 17],
       [33, 17,  7, 24, 29, 31],
       [26, 33, 31, 20, 26, 17],
       [29, 17, 32, 28, 21, 13],
       [29, 28, 22, 23, 17, 29]])

In [12]:
df1 = pd.DataFrame(data,index = dates,columns = list('ABCDEF'))

In [13]:
df1

             A   B   C   D   E   F
2017-01-02   6  10  13  22  20  26
2017-01-03  33  35  23  18  14  17
2017-01-04  33  17   7  24  29  31
2017-01-05  26  33  31  20  26  17
2017-01-06  29  17  32  28  21  13
2017-01-07  29  28  22  23  17  29

In [14]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130107'),
                   'C':pd.Series(1,index = list(range(4))),
                   'D':np.array([3]*4),
                   'E':pd.Categorical(["test","train","test","train"])})

In [15]:
df2

     A          B  C  D      E
0  1.0 2013-01-07  1  3   test
1  1.0 2013-01-07  1  3  train
2  1.0 2013-01-07  1  3   test
3  1.0 2013-01-07  1  3  train

In [16]:
df2['F'] = 'foo'

In [17]:
df2

     A          B  C  D      E    F
0  1.0 2013-01-07  1  3   test  foo
1  1.0 2013-01-07  1  3  train  foo
2  1.0 2013-01-07  1  3   test  foo
3  1.0 2013-01-07  1  3  train  foo

In [18]:
df2.dtypes

A           float64
B    datetime64[ns]
C             int64
D             int32
E          category
F            object
dtype: object

In [19]:
a = pd.Categorical(np.arange(10),ordered = True)

In [20]:
a

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Categories (10, int64): [0 < 1 < 2 < 3 ... 6 < 7 < 8 < 9]

In [21]:
a.min()

0

In [22]:
a.codes

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int8)

In [23]:
a.categories

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [24]:
a.ordered

True

In [25]:
a.dtype

CategoricalDtype(categories=[0, 1, 2, 3, 4, 5, 6, 7, 8, 9], ordered=True)

In [26]:
a[1]

1

In [27]:
pd.Categorical?

In [28]:
len(a)

10

In [29]:
a.T

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Categories (10, int64): [0 < 1 < 2 < 3 ... 6 < 7 < 8 < 9]

In [30]:
df1.T

   2017-01-02  2017-01-03  2017-01-04  2017-01-05  2017-01-06  2017-01-07
A           6          33          33          26          29          29
B          10          35          17          33          17          28
C          13          23           7          31          32          22
D          22          18          24          20          28          23
E          20          14          29          26          21          17
F          26          17          31          17          13          29

In [31]:
df1

             A   B   C   D   E   F
2017-01-02   6  10  13  22  20  26
2017-01-03  33  35  23  18  14  17
2017-01-04  33  17   7  24  29  31
2017-01-05  26  33  31  20  26  17
2017-01-06  29  17  32  28  21  13
2017-01-07  29  28  22  23  17  29

In [32]:
df1.sort_index(axis = 0,ascending=False)

             A   B   C   D   E   F
2017-01-07  29  28  22  23  17  29
2017-01-06  29  17  32  28  21  13
2017-01-05  26  33  31  20  26  17
2017-01-04  33  17   7  24  29  31
2017-01-03  33  35  23  18  14  17
2017-01-02   6  10  13  22  20  26

In [33]:
df1.sort_values(by = ['B','C'],inplace = True)

In [34]:
df1.sort_values?

In [35]:
df1

             A   B   C   D   E   F
2017-01-02   6  10  13  22  20  26
2017-01-04  33  17   7  24  29  31
2017-01-06  29  17  32  28  21  13
2017-01-07  29  28  22  23  17  29
2017-01-05  26  33  31  20  26  17
2017-01-03  33  35  23  18  14  17

In [36]:
df1['2017-01-03':'2017-01-06']

             A   B   C   D   E   F
2017-01-04  33  17   7  24  29  31
2017-01-06  29  17  32  28  21  13
2017-01-05  26  33  31  20  26  17
2017-01-03  33  35  23  18  14  17

In [37]:
df1

             A   B   C   D   E   F
2017-01-02   6  10  13  22  20  26
2017-01-04  33  17   7  24  29  31
2017-01-06  29  17  32  28  21  13
2017-01-07  29  28  22  23  17  29
2017-01-05  26  33  31  20  26  17
2017-01-03  33  35  23  18  14  17

In [38]:
df1[0:3]

             A   B   C   D   E   F
2017-01-02   6  10  13  22  20  26
2017-01-04  33  17   7  24  29  31
2017-01-06  29  17  32  28  21  13

In [39]:
df1.iloc[1]

A    33
B    17
C     7
D    24
E    29
F    31
Name: 2017-01-04 00:00:00, dtype: int32

In [40]:
df1.loc['2017-01-04':'2017-01-07']

             A   B   C   D   E   F
2017-01-04  33  17   7  24  29  31
2017-01-06  29  17  32  28  21  13
2017-01-07  29  28  22  23  17  29
2017-01-05  26  33  31  20  26  17

In [41]:
df1[['A','C']]

             A   C
2017-01-02   6  13
2017-01-04  33   7
2017-01-06  29  32
2017-01-07  29  22
2017-01-05  26  31
2017-01-03  33  23

In [42]:
df1.iloc[1:2]

             A   B  C   D   E   F
2017-01-04  33  17  7  24  29  31

In [43]:
df1[['A','C']]

             A   C
2017-01-02   6  13
2017-01-04  33   7
2017-01-06  29  32
2017-01-07  29  22
2017-01-05  26  31
2017-01-03  33  23

In [44]:
df1[df1['B']>20]

             A   B   C   D   E   F
2017-01-07  29  28  22  23  17  29
2017-01-05  26  33  31  20  26  17
2017-01-03  33  35  23  18  14  17

In [45]:
df1

             A   B   C   D   E   F
2017-01-02   6  10  13  22  20  26
2017-01-04  33  17   7  24  29  31
2017-01-06  29  17  32  28  21  13
2017-01-07  29  28  22  23  17  29
2017-01-05  26  33  31  20  26  17
2017-01-03  33  35  23  18  14  17

In [46]:
df1.loc['2017-01-02':'2017-01-07',['D','E']]

             D   E
2017-01-02  22  20
2017-01-04  24  29
2017-01-06  28  21
2017-01-07  23  17
2017-01-05  20  26
2017-01-03  18  14

In [47]:
df1.iloc[:,0:2]

             A   B
2017-01-02   6  10
2017-01-04  33  17
2017-01-06  29  17
2017-01-07  29  28
2017-01-05  26  33
2017-01-03  33  35

In [48]:
df1[df1.1>0]

SyntaxError: invalid syntax (<ipython-input-48-8ee6516bce1a>, line 1)

In [ ]:
df1.2017-01-04

In [ ]:
df1[df1>20]

In [ ]:
df2

In [ ]:
df3 = df1.copy()

In [ ]:
df3

In [ ]:
df3['H']=['one', 'one','two','three','four','three']

In [ ]:

df3

In [ ]:
df3.isin(['two','four'])

In [ ]:
df_single_level_cols = pd.DataFrame([[0, 1], [2, 3]],
...                                     index=['cat', 'dog'],
...                                     columns=['weight', 'height'])

In [ ]:
df_single_level_cols

In [ ]:
a = df_single_level_cols.stack()

In [ ]:
a.unstack()

In [ ]:
 multicol2 = pd.MultiIndex.from_tuples([('weight', 'kg'),
...                                        ('height', 'm')])

In [ ]:
multicol2

In [ ]:
df_multi_level_cols2 = pd.DataFrame([[1.0, 2.0], [3.0, 4.0]],
...                                     index=['cat', 'dog'],
...                                     columns=multicol2)

In [ ]:
df_multi_level_cols2.stack()

In [ ]:
df_multi_level_cols2

In [ ]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))

In [ ]:
tuples

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [ ]:
index

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [ ]:
a = df.stack()

In [ ]:
df

In [ ]:
a

In [ ]:
a.unstack(0)

In [ ]:
df

#

In [ ]:
df1

In [ ]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200,200,404,404,301],'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},index=index)

In [ ]:
df

In [ ]:
new_index= ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10',
...             'Chrome']

In [ ]:
a = df.reindex(new_index)

In [ ]:
df.reindex(['http_status','response_times'],axis = 'columns')

In [ ]:
a.reindex(new_index,method = 'bfill')

In [ ]:
a

In [ ]:
a.fillna(0)

In [52]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [53]:
df

                   A         B         C         D
2013-01-01  0.597642  0.209689  0.000917  0.556799
2013-01-02  1.187253  0.695625 -0.832793 -0.032175
2013-01-03  2.061990 -0.960087  0.265830  1.470442
2013-01-04  1.165250 -2.019663  0.972262 -0.008205
2013-01-05  0.918456 -0.504180  0.190476 -0.439111
2013-01-06  0.864974  0.631970 -0.110266 -1.171152

In [54]:
df2 = df.copy()

In [57]:
df2['E']=['one','two','three',np.nan,'four','five']

In [59]:
df2

                   A         B         C         D      E
2013-01-01  0.597642  0.209689  0.000917  0.556799    one
2013-01-02  1.187253  0.695625 -0.832793 -0.032175    two
2013-01-03  2.061990 -0.960087  0.265830  1.470442  three
2013-01-04  1.165250 -2.019663  0.972262 -0.008205    NaN
2013-01-05  0.918456 -0.504180  0.190476 -0.439111   four
2013-01-06  0.864974  0.631970 -0.110266 -1.171152   five

In [60]:
df2['E'].isin(['one','two'])

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [61]:
s1 = pd.Series(['one','two','three',np.nan])

In [62]:
s1

0      one
1      two
2    three
3      NaN
dtype: object

In [63]:
df2['E'].isin(s1)

2013-01-01     True
2013-01-02     True
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [65]:
a = pd.DataFrame({'A':['one','two'],
                 'B':['three','four']})

In [66]:
a

     A      B
0  one  three
1  two   four

In [67]:
df2['E'].isin(a)

2013-01-01    False
2013-01-02    False
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [70]:
df=pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','bar'],'B':['one','one','two','three','two','two','one','three'],'C':np.random.randn(8),'D':np.random.randn(8)})

In [71]:
df

     A      B         C         D
0  foo    one -1.255052 -0.727699
1  bar    one  0.789899  0.611362
2  foo    two  0.695853 -0.722188
3  bar  three -1.357960 -0.568615
4  foo    two  0.280856  0.404163
5  bar    two  0.491628 -0.369769
6  foo    one  0.440343  0.937661
7  bar  three  0.005967  0.618302

In [72]:
df.groupby('A').sum()

            C         D
A
bar -0.070466  0.291279
foo  0.162000 -0.108063

In [74]:
df=pd.DataFrame({'A':['dog','dog','cat','cat','dog','dog'],
              'B':['like','dislike','like','dislike','like','like'],
                 'C':np.random.rand(6)})

In [75]:
df

     A        B         C
0  dog     like  0.199846
1  dog  dislike  0.772898
2  cat     like  0.407400
3  cat  dislike  0.464662
4  dog     like  0.861472
5  dog     like  0.216250

In [76]:
df.groupby(['A','B']).mean()

                    C
A   B
cat dislike  0.464662
    like     0.407400
dog dislike  0.772898
    like     0.425856

In [81]:
df = pd.DataFrame(np.random.randn(4,4),columns = list('ABCD'))

In [82]:
df

          A         B         C         D
0 -0.571737 -0.550357 -0.108694  0.585776
1  1.369046 -0.519360  0.434705  0.652526
2 -0.012081 -0.164514 -0.582987  1.147709
3  0.485277 -0.203572  0.189086  1.190635

In [95]:
df = pd.DataFrame({'A':np.nan,'B':'nihao','C':1,'D':pd.Timestamp(20130102)},index = list('a'))

In [96]:
df

    A      B  C                             D
a NaN  nihao  1 1970-01-01 00:00:00.020130102

In [97]:
df.dtypes

A           float64
B            object
C             int64
D    datetime64[ns]
dtype: object

In [98]:
df = pd.DataFrame({'A':[1,2,3],
'B':['a','b','c']})
df2 = pd.DataFrame({'A':[1,2,3],
'B':['a','b','d']})

In [117]:
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [118]:
df2

    0   1      E
0   0   1    one
1   2   3    one
2   4   5    two
3   6   7  three
4   8   9   four
5  10  11  three

In [104]:
df[df['B'].isin(df2['B'])]

   A  B
0  1  a
1  2  b

In [105]:
df = pd.DataFrame(np.arange(12).reshape(3,4))

In [106]:
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [109]:
df[(df>3)&(df<6)]

     0    1   2   3
0  NaN  NaN NaN NaN
1  4.0  5.0 NaN NaN
2  NaN  NaN NaN NaN

In [114]:
df2 = pd.DataFrame(np.arange(12).reshape(6,2))
df2

    0   1
0   0   1
1   2   3
2   4   5
3   6   7
4   8   9
5  10  11

In [115]:
df2['E'] = ['one','one','two','three','four','three']

##

In [116]:
df2

    0   1      E
0   0   1    one
1   2   3    one
2   4   5    two
3   6   7  three
4   8   9   four
5  10  11  three

In [119]:
df = pd.DataFrame({'A':[1,2,3],
'B':['a','b','c']})
df3 = pd.DataFrame({'A':[1,2,3],
'B':['a','b','d']})

In [127]:
#df['B']df['B'].isin(df3['B'])
df['B'][df['B'].isin(df3['B'])]

0    a
1    b
Name: B, dtype: object

In [122]:
df[df['B'].isin(df3['B'])]

   A  B
0  1  a
1  2  b

In [129]:
df4=pd.DataFrame(np.random.randn(6,4),columns=list('ABCD'))

In [130]:
df4

          A         B         C         D
0  1.518511 -3.374317 -1.032582 -0.199373
1 -0.356853  0.419704  1.375436 -0.149551
2  1.081832 -0.856743 -0.106056 -0.505966
3  0.247911  0.558105 -0.124758 -0.027507
4 -0.028400 -1.107374  0.385198  0.687209
5 -0.205214 -0.053192 -0.105820 -0.213494

In [134]:
df4[df4>0]

          A         B         C         D
0  1.518511       NaN       NaN       NaN
1       NaN  0.419704  1.375436       NaN
2  1.081832       NaN       NaN       NaN
3  0.247911  0.558105       NaN       NaN
4       NaN       NaN  0.385198  0.687209
5       NaN       NaN       NaN       NaN

In [135]:
df=pd.DataFrame([[60,170],[55,180],[63,183]],index = ['Tom','Jack','Peter'],columns = ['weight','height'])

In [136]:
df

       weight  height
Tom        60     170
Jack       55     180
Peter      63     183

In [137]:
df.loc[[False, False, True]]

       weight  height
Peter      63     183

In [138]:
df = pd.DataFrame(np.random.random((5,3)),columns=list('ABC'))

In [139]:
df

          A         B         C
0  0.512196  0.528201  0.473922
1  0.262113  0.446752  0.342331
2  0.034863  0.924156  0.097657
3  0.180774  0.075274  0.228601
4  0.500131  0.690168  0.869694

In [142]:
df.iloc[4,1]

0.6901680414296106

In [143]:
df = pd.DataFrame([[1,2],[4,5]],index=['aa','bb'],columns=['a','b'])

In [144]:
df

    a  b
aa  1  2
bb  4  5

In [152]:
#df.loc['aa']
#df.iloc[0]
df[0:1]

    a  b
aa  1  2

In [153]:
df = pd.DataFrame([[1,2,3,4],[4,5,6,7]],index=['aa','bb'],columns=['a','b','c','d'])

In [154]:
df

    a  b  c  d
aa  1  2  3  4
bb  4  5  6  7

In [161]:
#df.loc['aa','c']
#df.at['aa','c']
df.iat[0,2]

3

In [162]:
df = pd.DataFrame({'A':[1,2,3],'B':['a','b','f']})

In [163]:
df

   A  B
0  1  a
1  2  b
2  3  f

In [167]:
df.iat[0,1]

'a'

In [171]:
df = pd.DataFrame({'A':[1,2,3],'B':['a','b','f']})

In [172]:
df

   A  B
0  1  a
1  2  b
2  3  f

In [173]:
df.loc[[0,1],'B']

0    a
1    b
Name: B, dtype: object

In [174]:
df = pd.DataFrame({'A':[1,2,3],'B':['a','b','f']})

In [175]:
df

   A  B
0  1  a
1  2  b
2  3  f

In [176]:
df.iat[1,1]

'b'

In [193]:
df = pd.DataFrame({'A':[1,2,3],'B':['a','b','f']})

In [194]:
df

   A  B
0  1  a
1  2  b
2  3  f

In [199]:
df.A[df.A>1] = -df.A

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [200]:
df

   A  B
0  1  a
1 -2  b
2 -3  f

In [206]:
df = pd.DataFrame({'A':np.array([np.nan,3,8,5]),
                       'B':np.array([np.nan]*4),
                        'C':1.0})

In [207]:
df

     A   B    C
0  NaN NaN  1.0
1  3.0 NaN  1.0
2  8.0 NaN  1.0
3  5.0 NaN  1.0

In [212]:
df['A'].dropna(how = 'all')

1    3.0
2    8.0
3    5.0
Name: A, dtype: float64

In [203]:
df.fillna(5)

     A    B    C
0  5.0  5.0  1.0
1  3.0  5.0  1.0
2  8.0  5.0  1.0
3  5.0  5.0  1.0

In [204]:
df = pd.Series([1,np.nan,np.nan,10,2])

In [205]:
df

0     1.0
1     NaN
2     NaN
3    10.0
4     2.0
dtype: float64

In [213]:
df = pd.DataFrame(np.arange(9).reshape(3,3),index = list('abc'))

In [214]:
df

   0  1  2
a  0  1  2
b  3  4  5
c  6  7  8

In [217]:
df.reindex(list('abC'),fill_value = 5)

   0  1  2
a  0  1  2
b  3  4  5
C  5  5  5

In [218]:
dates = pd.date_range('20130101',periods = 6)
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns = list('ABCD'))

In [219]:
df

                   A         B         C         D
2013-01-01 -1.747784 -0.268483 -0.708040  0.677089
2013-01-02 -1.724517 -1.247010  0.136360  0.739228
2013-01-03 -0.367359  0.064312 -1.483137  1.187849
2013-01-04 -0.310593 -0.448767  0.801852  0.139441
2013-01-05 -0.390769  0.970635  0.590588 -0.691168
2013-01-06 -0.928203 -1.331850 -0.657660  0.896844

In [221]:
df.sort_index(axis=0,ascending = False)

                   A         B         C         D
2013-01-06 -0.928203 -1.331850 -0.657660  0.896844
2013-01-05 -0.390769  0.970635  0.590588 -0.691168
2013-01-04 -0.310593 -0.448767  0.801852  0.139441
2013-01-03 -0.367359  0.064312 -1.483137  1.187849
2013-01-02 -1.724517 -1.247010  0.136360  0.739228
2013-01-01 -1.747784 -0.268483 -0.708040  0.677089

In [222]:
df = pd.DataFrame(np.random.randn(8,4),columns = ['A','B','C','D'])

In [223]:
df

          A         B         C         D
0  0.958265 -0.823560 -1.345301 -0.206410
1 -0.755475  0.419285 -1.067464 -1.029832
2 -2.047361  0.335073 -0.726563  0.074088
3  0.635564 -0.456552  0.380108 -1.161229
4  0.501894  0.223442  0.056860  2.778283
5 -0.904926 -1.863196 -0.133085 -0.222937
6  0.421107 -1.957887 -0.340998 -0.592119
7 -0.678716 -0.802116  0.900305  0.623728

In [224]:
s = df.iloc[2]

In [226]:
s

A   -2.047361
B    0.335073
C   -0.726563
D    0.074088
Name: 2, dtype: float64

In [227]:
df.append(s,ignore_index = True)

          A         B         C         D
0  0.958265 -0.823560 -1.345301 -0.206410
1 -0.755475  0.419285 -1.067464 -1.029832
2 -2.047361  0.335073 -0.726563  0.074088
3  0.635564 -0.456552  0.380108 -1.161229
4  0.501894  0.223442  0.056860  2.778283
5 -0.904926 -1.863196 -0.133085 -0.222937
6  0.421107 -1.957887 -0.340998 -0.592119
7 -0.678716 -0.802116  0.900305  0.623728
8 -2.047361  0.335073 -0.726563  0.074088

In [228]:
left = pd.DataFrame({'key': ['foo', 'for'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'fok'], 'rval': [4, 5]})

In [230]:
right

   key  rval
0  foo     4
1  fok     5

In [229]:
left

   key  lval
0  foo     1
1  for     2

In [231]:
df = pd.merge(left, right, how='left')

In [232]:
df

   key  lval  rval
0  foo     1   4.0
1  for     2   NaN

In [245]:
left = pd.DataFrame({'key':['foo','foo','hello','foo'],'lval' : [4,6,6,7]})
right = pd.DataFrame({'key':['foo','foo','jack','hi'],'rval' : [1,2,3,5]})

In [246]:
pd.merge(left,right,on = 'key')

   key  lval  rval
0  foo     4     1
1  foo     4     2
2  foo     6     1
3  foo     6     2
4  foo     7     1
5  foo     7     2

In [254]:
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12],
[6, 9, 12],],
index=[1, 2, 3,4],columns=['a', 'b', 'c'])

In [255]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [256]:
pieces = [df[:1], df[1:2], df[2:]]

In [257]:
pieces

[   a  b   c
 1  4  7  10,    a  b   c
 2  5  8  11,    a  b   c
 3  6  9  12
 4  6  9  12]

In [261]:
df[:1]

   a  b   c
1  4  7  10

In [262]:
df[1:2]

   a  b   c
2  5  8  11

In [263]:
df[2:]

   a  b   c
3  6  9  12
4  6  9  12

In [11]:
df = pd.DataFrame(np.array([[1,1,2,2,3,3],
                            [3,3,22,2,3,1],
                            [1,1,2,4,3,1]]),
                           index = list('aba'),columns = list('ABABCD'))

In [12]:
df

   A  B   A  B  C  D
a  1  1   2  2  3  3
b  3  3  22  2  3  1
a  1  1   2  4  3  1

In [14]:
df.drop_duplicates('A',)

   A  B   A  B  C  D
a  1  1   2  2  3  3
b  3  3  22  2  3  1

In [16]:
df1=pd.DataFrame(np.arange(30).reshape(5,6),columns=list('ABCDEF'))

In [17]:
df1

    A   B   C   D   E   F
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29

In [20]:
#df1[['B','D','F']]
df1.iloc[:,[1,3,5]]

    B   D   F
0   1   3   5
1   7   9  11
2  13  15  17
3  19  21  23
4  25  27  29

In [21]:
df1=pd.DataFrame(np.arange(20).reshape(4,5),columns=['abc','bca','aaa','ddd','abd'])

In [22]:

df1

   abc  bca  aaa  ddd  abd
0    0    1    2    3    4
1    5    6    7    8    9
2   10   11   12   13   14
3   15   16   17   18   19

In [23]:
df1.filter(regex='a[b-c]')

   abc  abd
0    0    4
1    5    9
2   10   14
3   15   19

In [24]:
df = pd.DataFrame({'A':[1,1,2,2],                    'B':[1,2,3,4],                   'C':np.random.randn(4)})

In [25]:
df

   A  B         C
0  1  1 -0.521749
1  1  2 -0.630875
2  2  3 -0.524171
3  2  4 -0.337532

In [26]:
df.groupby('A').size()

A
1    2
2    2
dtype: int64

In [27]:
df = pd.DataFrame( {"a" : [4 ,np.NAN, np.NAN], "b" : [7, np.NAN, 9], "c" : [10, 11, 12]}, index = [1, 2, 3])

In [28]:
df

     a    b   c
1  4.0  7.0  10
2  NaN  NaN  11
3  NaN  9.0  12

In [31]:
df.count(axis=1)

1    3
2    1
3    2
dtype: int64

In [32]:
df = pd.DataFrame( {"a" : [4 ,5, 6], "b" : [7, 8, 9], "c" : [10, 11, 12]}, index = [1, 2, 3])

In [33]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [34]:
df.sum()

a    15
b    24
c    33
dtype: int64

In [35]:
df = pd.DataFrame({'A': range(1, 11), 'B': np.random.randn(10)})

In [36]:
df

    A         B
0   1 -0.535519
1   2  0.851613
2   3 -1.975472
3   4 -0.063896
4   5  0.907755
5   6 -2.262667
6   7 -0.653283
7   8 -1.286858
8   9 -0.384340
9  10 -0.526384

In [37]:
pd.qcut(df.A, 2, labels=False)

0    0
1    0
2    0
3    0
4    0
5    1
6    1
7    1
8    1
9    1
Name: A, dtype: int64

In [38]:
df

    A         B
0   1 -0.535519
1   2  0.851613
2   3 -1.975472
3   4 -0.063896
4   5  0.907755
5   6 -2.262667
6   7 -0.653283
7   8 -1.286858
8   9 -0.384340
9  10 -0.526384

In [40]:
x = np.array([ [ 0, 1, 2, 3, 4], [9, 8, 7, 6] ])

In [41]:
x.dtype

dtype('O')

In [42]:
a = np.arange(12, dtype=np.float).reshape((3,4))

In [44]:
a.astype(np.int)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [45]:
a

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [46]:
i = np.array([
    [5, 10, 15],
    [20, 25, 30],
    [35, 40, 45],
])

In [47]:
i

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [49]:
i[:,0:2]

array([[ 5, 10],
       [20, 25],
       [35, 40]])

In [2]:
A = np.arange(25).reshape(5,5)

In [3]:
A

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [12]:
A[[0,1]] = A[[1,0]]

In [13]:
A

array([[ 5,  6,  7,  8,  9],
       [ 0,  1,  2,  3,  4],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])